function myFunction(){
    var x = document.getElementById("opt").value;
    document.getElementById("model").innerHTML = "";
    document.getElementById("accesoari").innerHTML = "";
         if(x == "Прахосмукачки"){
         y = ["FC 6404","FC 6401"];
        z = ["Маркуч","Оригинален кашон","ОКБ", "ОГК", "Кабел"]

         } else if (x == "Кафемашини") {
         y = ["hd 8829", "HD 8423"];
         z = ["Цедка","Ръкохватка","Тавичка", "Оригинален кашон","ОКБ", "ОГК", "Кабел"]
         } else if(x == "Сокоизтиквачки") {
         y = ["HR 1919", "HR 1923"]
         z = ["Оригинален кашон","ОКБ", "ОГК", "Кабел"]
         } else if(x == "Блендъри") {
         y = ["HR 2054", "HR 2124"];
         z = ["Кана","Оригинален кашон","ОКБ", "ОГК", "Кабел"]
         } else if(x == "Ютии") {
         y = ["GC 9620", "GC 9683"];
         z = ["Оригинален кашон","ОКБ", "ОГК"]
         } else if(x == "Телевизори") {
            y = ["T 9620", "T 9683"];
            z = ["Оригинален кашон","ОКБ", "ОГК", "Дистанционно", "Захранващ кабел"]
         } else if(x == "Телефони") {
            y = ["G 9620", "G 9683"];
            z = ["Оригинална кутия","ОКБ", "ОГК", "Захранващ кабел", "Слушалки" ]
        }else if(x == "Слушалки") {
            y = ["SS 9620", "SS 9683"];
            z = ["Оригинална кутия","ОКБ", "ОГК", "Кабел за зареждане"]
        } else if(x == "Хладилници") {
            y = ["C 9620", "C 9683"];
            z = ["Оригинален кашон","ОКБ", "ОГК"]
        }  else if(x == "Печки") {
           y = ["GP 9620", "GP 9683"];
           z = ["Оригинален кашон","ОКБ", "ОГК"]
        } else if(x == "Стерео уредби") {
            y = ["UC 9620", "UC 9683"];
            z = ["Оригинален кашон","ОКБ", "ОГК", "Дистанционно"]
        } else if(x == "Мултимедия") {
            y = ["MS 9620", "MS 9683"];
            z = ["Оригинален кашон","ОКБ", "ОГК", "Дистанционно"]
    };
                                

         
     var i, m;
     for (i=0; i < y.length; i++){
         document.getElementById("model").innerHTML += "<option>"+ y[i]+"</option>";
        };
    for (m=0; m < z.length; m++){
        document.getElementById("accesoari").innerHTML += "<label>"+ z[m]+"<input value="+z[m]+" name='gadget[]' type='checkbox'></label>";
    }
    
}


